# Operaciones

Hay muchas operaciones en Pandas que le serán muy útiles, pero que no caen dentro de una categoría dada. Veremos algunas en esta lección:

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Información sobre valores únicos

In [2]:
df['col2'].unique()

array([444, 555, 666])

In [3]:
df['col2'].nunique()

3

In [4]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selección de datos

In [5]:
#Seleccionar del DataFrame utilizando criterios sobre columnas múltiples
nuevodf = df[(df['col1']>2) & (df['col2']==444)]

In [6]:
nuevodf

   col1  col2 col3
3     4   444  xyz

### Aplicación de funciones

In [7]:
def por2(x):
    return x*2

In [8]:
df['col1'].apply(por2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [9]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [10]:
df['col1'].sum()

10

** Eliminación permanente de una columna**

In [11]:
del df['col1']

In [12]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Obtener los nombres de las columnas e indices: **

In [13]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Ordenar (sort) un DataFrame:**

In [15]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
df.sort_values(by='col2') #inplace=False por default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Encontrar valores nulos**

In [17]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [18]:
# Eliminar filas con valores NaN
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Reemplazando valores NaN con otra cosa: **

In [19]:
import numpy as np

In [20]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [22]:
df.fillna('NULO')

   col1  col2 col3
0     1  NULO  abc
1     2   555  def
2     3   666  ghi
3  NULO   444  xyz

In [24]:
datos = {'A':['lero','lero','lero','candelero','candelero','candelero'],
     'B':['uno','uno','dos','dos','uno','uno'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(datos)

In [25]:
df

           A    B  C  D
0       lero  uno  x  1
1       lero  uno  y  3
2       lero  dos  x  2
3  candelero  dos  y  5
4  candelero  uno  x  4
5  candelero  uno  y  1

In [26]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C                x    y
A         B
candelero dos  NaN  5.0
          uno  4.0  1.0
lero      dos  2.0  NaN
          uno  1.0  3.0

# Buen trabajo!